In [234]:
import pandas as pd
import os
import seaborn as sns
import matplotlib.pyplot as plt
sns.set_style('whitegrid')
%matplotlib inline

In [136]:
#importing csv file and previewing first 5 rows
df = pd.read_csv('./salesmonths/Sales_April_2019.csv')

df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [137]:
#checking data types of all columns
print(df['Order ID'].apply(type)[0])
print(df['Product'].apply(type)[0])
print(df['Quantity Ordered'].apply(type)[0])
print(df['Price Each'].apply(type)[0])
print(df['Order Date'].apply(type)[0])
print(df['Purchase Address'].apply(type)[0])

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [138]:
#locate files
files = [file for file in os.listdir('./salesmonths/')]

#create blank dataframe to everything
all_months_data = pd.DataFrame()

#logic that will gather the name of all month files + concatenate everything
for file in files:
    df = pd.read_csv('./salesmonths/'+file)
    all_months_data = pd.concat([all_months_data, df])
    
#preview of merged dataframe 
all_months_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"

In [139]:
#storing it as csv
all_months_data.to_csv('all_data.csv', index = False)

In [140]:
#defining merged file as single dataframe
all_data = pd.read_csv('all_data.csv')
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"

# Process of Gathering Insights on Sales Performance

In [76]:
#First, delimiting out the month, day, and year separately and converting to proper datatype

In [159]:
all_data['Month'] = all_data['Order Date'].str[0:2]
all_data['Month'] = all_data['Month'].astype('int32')
all_data['Month'].head()

0    12
1    12
2    12
3    12
4    12
Name: Month, dtype: int32

In [158]:
all_data['Day'] = all_data['Order Date'].str[3:5]
all_data['Day'] = all_data['Day'].astype('int32')
all_data['Day'].head()

0    30
1    29
2    12
3    22
4    18
Name: Day, dtype: int32

In [157]:
all_data['Year'] = all_data['Order Date'].str[6:8]
all_data['Year'] = all_data['Year'].astype('int32')
all_data['Year'].head()

0    19
1    19
2    19
3    19
4    19
Name: Year, dtype: int32

In [ ]:
#Cleaning out null rows

In [153]:
#viewing the rows that are null
nan_df = all_data[all_data.isna().any(axis=1)]
nan_df.head()

#dropping the null rows from all_data
all_data = all_data.dropna(how='any')
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Day,Year
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001",12,30,19
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12,29,19
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12,12,19
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",12,22,19
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",12,18,19

In [255]:
#Diving into the "Or" values populating under the "Order Date" column and trying to remove them

In [155]:
#previewing the invalid data
testdf = all_data[all_data['Order Date'].str[0:2] == 'Or']
testdf.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Day,Year
254,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or,er,Da
705,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or,er,Da
1101,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or,er,Da
2875,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or,er,Da
3708,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or,er,Da

In [156]:
#deleting invalid rows
all_data = all_data[all_data['Order Date'].str[0:2] != 'Or']

In [119]:
#converting necessary columns to numeric values

In [160]:
all_data['Quantity Ordered'] = pd.to_numeric(all_data['Quantity Ordered'])
all_data['Price Each'] = pd.to_numeric(all_data['Price Each'])

all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Day,Year
0,295665,Macbook Pro Laptop,1,1700.00,12/30/19 00:01,"136 Church St, New York City, NY 10001",12,30,19
1,295666,LG Washing Machine,1,600.00,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12,29,19
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12,12,19
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",12,22,19
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",12,18,19

In [162]:
#Creating a new sales column that calculate quantity * price
all_data['Sales'] = (all_data['Quantity Ordered'] * all_data['Price Each'])
all_data['Sales'].head()

0    1700.00
1     600.00
2      11.95
3     149.99
4      11.95
Name: Sales, dtype: float64

In [213]:
all_data.groupby('Month').sum()['Sales'].sort_values(ascending = False)

Month
12    4.613443e+06
10    3.736727e+06
4     3.390670e+06
11    3.199603e+06
5     3.152607e+06
3     2.807100e+06
7     2.647776e+06
6     2.577802e+06
8     2.244468e+06
2     2.202022e+06
9     2.097560e+06
1     1.822257e+06
Name: Sales, dtype: float64

***Findings***

`Highest Sales:` 4,613,443 USD in December || `Lowest Sales:` 1,822,257 USD in January

**Assumption**: Sales may be spiking in December due to the holidays followed by a slowed momentum in January  possibly due to a consumer financial recovery period.

In [232]:
#Sales by Product
all_data.groupby('Product').sum()['Sales'].sort_values(ascending = False).head(10)

Product
Macbook Pro Laptop            8037600.00
iPhone                        4794300.00
ThinkPad Laptop               4129958.70
Google Phone                  3319200.00
27in 4K Gaming Monitor        2435097.56
34in Ultrawide Monitor        2355558.01
Apple Airpods Headphones      2349150.00
Flatscreen TV                 1445700.00
Bose SoundSport Headphones    1345565.43
27in FHD Monitor              1132424.50
Name: Sales, dtype: float64

In [254]:
all_data['Product'].sum()['Sales'].head(10).plot(kind='barh', figsize=(6,10), color ='purple')

TypeError: string indices must be integers

In [233]:
#Number of products sold
all_data.groupby('Product').sum()['Quantity Ordered'].sort_values(ascending = False).head(10)

Product
AAA Batteries (4-pack)        31017
AA Batteries (4-pack)         27635
USB-C Charging Cable          23975
Lightning Charging Cable      23217
Wired Headphones              20557
Apple Airpods Headphones      15661
Bose SoundSport Headphones    13457
27in FHD Monitor               7550
iPhone                         6849
27in 4K Gaming Monitor         6244
Name: Quantity Ordered, dtype: int64